tutorials/incompressible/pimpleFoam/laminar/planarPoiseuille/setups.orig/common/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type            vectorSemiImplicitSource;

    timeStart       0.0;
    duration        1000;
    selectionMode   all;

    volumeMode      specific;

    sources
    {
        U    ((5 0 0) 0);
    }
}


// ************************************************************************* //
